## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_glue_trigger.platform_support_freshdesk`  |
| update | `aws_s3_object.platform_support_freshdesk_job` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_trigger.platform_support_freshdesk will be created
  + resource "aws_glue_trigger" "platform_support_freshdesk" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "Platform / Support / Freshdesk"
      + schedule = "cron(30 5 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "Platform / Support / Freshdesk"
        }
    }

  # aws_s3_object.platform_support_freshdesk_job will be updated in-place
  ~ resource "aws_s3_object" "platform_support_freshdesk_job" {
      ~ etag                          = "84204c7ef1a9ff893543984a154bd6ba" -> "1a47d866f30a59c0448a2f62553d1860"
        id                            = "platform/support/freshdesk/process_tickets.py"
        tags                          = {}
      ~ version_id                    = "OIRv3DXYU3hfI3N4acs47yHwTr2kLmmP" -> (known after apply)
        # (23 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.platform_support_freshdesk_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.platform_support_freshdesk_requirements"]

39 tests, 19 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
